Tekla.Structures.AnalysisInternal.DotAnalysisPart
The serialization structure for AnalysisPart.

Tekla.Structures.AnalysisInternal.DotAnalysisPart._AnalysisObject
The analysis object instance.

Tekla.Structures.AnalysisInternal.DotAnalysisPart._PartID
The identifier of the physical part.

Tekla.Structures.AnalysisInternal.DotAnalysisPart._PartName
The name of the physical part.

Tekla.Structures.AnalysisInternal.DotAnalysisPart._PartType
The type of the physical part.

Tekla.Structures.AnalysisInternal.DotAnalysisPart._AnalysisType
The analysis type of the analysis part.

Tekla.Structures.AnalysisInternal.DotAnalysisPart._Material
The material of the analysis part.

Tekla.Structures.AnalysisInternal.DotAnalysisPart._Profile
The profile of the analysis part.

Tekla.Structures.AnalysisInternal.DotAnalysisPart._OverrideProfile
The override profile of the analysis part.

Tekla.Structures.AnalysisInternal.DotAnalysisPart._CoordinateSystem
The coordinate system of the analysis part.

Tekla.Structures.AnalysisInternal.DotAnalysisPart._UpDirection
The up direction of the analysis part.

Tekla.Structures.AnalysisInternal.DotAnalysisPart._Curvature
The radius of the analysis part.

Tekla.Structures.AnalysisInternal.DotAnalysisPart._AnalysisPartAnalysisProperties
The analysis part analysis properties.

Tekla.Structures.AnalysisInternal.DotAnalysisPart._AnalysisPartCompositeProperties
The analysis part composite properties.

Tekla.Structures.AnalysisInternal.DotAnalysisPart._AnalysisPartSpanningProperties
The analysis part spanning properties.

Tekla.Structures.AnalysisInternal.DotAnalysisPart._AnalysisPartLoadingProperties
The analysis part loading properties.

Tekla.Structures.AnalysisInternal.DotAnalysisPart._AnalysisPartPositionProperties
The analysis part position properties.

Tekla.Structures.AnalysisInternal.DotAnalysisPart._AnalysisPartBarAttributes
The analysis part bar attributes.

Tekla.Structures.AnalysisInternal.DotAnalysisPart._AnalysisPartAreaAttributes
The analysis part area attributes.

Tekla.Structures.AnalysisInternal.DotAnalysisPart._AnalysisDesignCode
The analysis design code.

Tekla.Structures.AnalysisInternal.DotAnalysisPart._LoadBearingOrder
The load bearing order.

Tekla.Structures.AnalysisInternal.DotAnalysisPart._SnapDistance
The snap distance.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.ToStruct(Tekla.Structures.Analysis.AnalysisPart)
DO NOT USE! For private internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisPart.FromStruct(Tekla.Structures.Analysis.AnalysisPart)
DO NOT USE! For private internal usage only!
P: P.